---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupedModelElemHasViewSpecificSubordinates
source: html/71d2c7e0-3a42-1a63-6e30-f7300ff78041.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupedModelElemHasViewSpecificSubordinates Property

Unable to group the selected elements. Model element in group has view specific subordinates or view specific element in group
 has non-view specific subordinates.

## Syntax (C#)
```csharp
public static FailureDefinitionId GroupedModelElemHasViewSpecificSubordinates { get; }
```